OpenFOAM10/edge_flame/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0  -0.01 -0.01) 
    (0.02 -0.01 -0.01) 
    (0.02  0.0  -0.01)
    (0.02  0.01 -0.01)
    (0.0   0.01 -0.01)
    (0.0   0.0  -0.01)
    (0.0  -0.01  0.01)
    (0.02 -0.01  0.01)
    (0.02  0.00  0.01)
    (0.02  0.01  0.01)
    (0.0   0.01  0.01)
    (0.0   0.0   0.01)
);

blocks
(
    hex (5 2 3 4 11 8 9 10) (256 128 1) simpleGrading (1 1 1)
    hex (0 1 2 5 6 7 8 11) (256 128 1) simpleGrading (1 1 1)
    
);
edges

(

 );
boundary
(
    fuel
    {
        type patch;
        faces
        (
            (5 11 10 4)
        );
    }
    air
    {
        type patch;
        faces
        (
            (0 6 11 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	 (6 7 1 0)    //bottom 
	 (10 9 3 4)  //top
	 (9 8 2 3) //exit top
	 (8 7 1 2) //exit bot
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	    (6 7 8 11)
	    (11 8 9 10)
	    (0 5 2 1)
            (5 4 3 2)
        );
    }
);

mergePatchPairs

(
 
 );
// ************************************************************************* //
